<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Varsayılan Test Modu
    |--------------------------------------------------------------------------
    |
    | true olarak ayarlandığında tüm işlemler test ortamına yönlendirilir.
    |
    */
    'test_mode' => env('SANALPOS_TEST_MODE', true),

    /*
    |--------------------------------------------------------------------------
    | HTTP İstek Zaman Aşımı (saniye)
    |--------------------------------------------------------------------------
    */
    'timeout' => env('SANALPOS_TIMEOUT', 60),

    /*
    |--------------------------------------------------------------------------
    | SSL Doğrulama
    |--------------------------------------------------------------------------
    |
    | Production ortamında true olmalıdır.
    |
    */
    'verify_ssl' => env('SANALPOS_VERIFY_SSL', true),

    /*
    |--------------------------------------------------------------------------
    | HTTP Bağlantı Zaman Aşımı (saniye)
    |--------------------------------------------------------------------------
    */
    'connect_timeout' => env('SANALPOS_CONNECT_TIMEOUT', 10),

];
